In [1]:
import numpy as np
import pandas as pd

# Teden 04: Uvoz in priprava podatkov

# Data Loading, Storage, and File Formats

## Reading and Writing Data in Text Format

### Reading text files



#### Text encoding: ASCII, Unicode, and others


**Unicode and UTF-8**

In [9]:
with open('out2.txt', 'wb') as f:
    f.write(bytes([65,66,67,255,192,193]))

In [10]:
!cat out2.txt

ABC���


`ABCÿÀÁ`

In [12]:
with open('out2.txt') as f:
    f.read()

UnicodeDecodeError: 'utf-8' codec can't decode byte 0xff in position 3: invalid start byte

In [14]:
with open('out2.txt', errors='ignore') as f:
    print(f.read())

ABC

In [15]:
with open('out2.txt', errors='replace') as f:
    print(f.read())

ABC���

In [17]:
with open('out2.txt', errors='backslashreplace') as f:
    print(f.read())

ABC\xff\xc0\xc1

#### Unstructured text

In [19]:
!cat data/DATA_test2.txt

Call me Ishmael. Some years ago--never mind how long precisely-- having little or no money in my purse, and nothing particular to interest me on shore, I thought I would sail about a little and see the watery part of the world. It is a way I have of driving off the spleen and regulating the circulation. Whenever I find myself growing grim about the mouth; whenever it is a damp, drizzly November in my soul; whenever I find myself involuntarily pausing before coffin warehouses, and bringing up the rear of every funeral I meet; and especially whenever my hypos get such an upper hand of me, that it requires a strong moral principle to prevent me from deliberately stepping into the street, and methodically knocking people's hats off--then, I account it high time to get to sea as soon as I can. This is my substitute for pistol and ball. With a philosophical flourish Cato throws himself upon his sword; I quietly take to the ship. There is nothing surprising in this. If they but knew it, almost all men in their degree, some time or other, cherish very nearly the same feelings towards the ocean with me.

There now is your insular city of the Manhattoes, belted round by wharves as Indian isles by coral reefs--commerce surrounds it with her surf. Right and left, the streets take you waterward. Its extreme downtown is the battery, where that noble mole is washed by waves, and cooled by breezes, which a few hours previous were out of sight of land. Look at the crowds of water-gazers there.

In [20]:
with open('data/DATA_test2.txt') as f:
    tekst = f.read()
    tekst_odstavki = tekst.split('\n\n')

In [21]:
tekst_odstavki

["Call me Ishmael. Some years ago--never mind how long precisely-- having little or no money in my purse, and nothing particular to interest me on shore, I thought I would sail about a little and see the watery part of the world. It is a way I have of driving off the spleen and regulating the circulation. Whenever I find myself growing grim about the mouth; whenever it is a damp, drizzly November in my soul; whenever I find myself involuntarily pausing before coffin warehouses, and bringing up the rear of every funeral I meet; and especially whenever my hypos get such an upper hand of me, that it requires a strong moral principle to prevent me from deliberately stepping into the street, and methodically knocking people's hats off--then, I account it high time to get to sea as soon as I can. This is my substitute for pistol and ball. With a philosophical flourish Cato throws himself upon his sword; I quietly take to the ship. There is nothing surprising in this. If they but knew it, almost all men in their degree, some time or other, cherish very nearly the same feelings towards the ocean with me.",
 'There now is your insular city of the Manhattoes, belted round by wharves as Indian isles by coral reefs--commerce surrounds it with her surf. Right and left, the streets take you waterward. Its extreme downtown is the battery, where that noble mole is washed by waves, and cooled by breezes, which a few hours previous were out of sight of land. Look at the crowds of water-gazers there.']

In [23]:
with open('data/DATA_test2.txt') as f:
    tekst = f.read()
    tekst_odstavki = tekst.split('\n\n')

In [26]:
takst_mali = tekst_odstavki[1].lower()

In [27]:
takst_mali

'there now is your insular city of the manhattoes, belted round by wharves as indian isles by coral reefs--commerce surrounds it with her surf. right and left, the streets take you waterward. its extreme downtown is the battery, where that noble mole is washed by waves, and cooled by breezes, which a few hours previous were out of sight of land. look at the crowds of water-gazers there.'

In [28]:
takst_mali = takst_mali.replace('.', '')

In [29]:
takst_mali

'there now is your insular city of the manhattoes, belted round by wharves as indian isles by coral reefs--commerce surrounds it with her surf right and left, the streets take you waterward its extreme downtown is the battery, where that noble mole is washed by waves, and cooled by breezes, which a few hours previous were out of sight of land look at the crowds of water-gazers there'

In [30]:
takst_mali = takst_mali.replace(',', '')

In [31]:
takst_mali

'there now is your insular city of the manhattoes belted round by wharves as indian isles by coral reefs--commerce surrounds it with her surf right and left the streets take you waterward its extreme downtown is the battery where that noble mole is washed by waves and cooled by breezes which a few hours previous were out of sight of land look at the crowds of water-gazers there'

In [35]:
takst_mali = takst_mali.replace('-', '')

In [36]:
takst_mali

'there now is your insular city of the manhattoes belted round by wharves as indian isles by coral reefscommerce surrounds it with her surf right and left the streets take you waterward its extreme downtown is the battery where that noble mole is washed by waves and cooled by breezes which a few hours previous were out of sight of land look at the crowds of watergazers there'

In [34]:
takst_mali.split()

['there',
 'now',
 'is',
 'your',
 'insular',
 'city',
 'of',
 'the',
 'manhattoes',
 'belted',
 'round',
 'by',
 'wharves',
 'as',
 'indian',
 'isles',
 'by',
 'coral',
 'reefscommerce',
 'surrounds',
 'it',
 'with',
 'her',
 'surf',
 'right',
 'and',
 'left',
 'the',
 'streets',
 'take',
 'you',
 'waterward',
 'its',
 'extreme',
 'downtown',
 'is',
 'the',
 'battery',
 'where',
 'that',
 'noble',
 'mole',
 'is',
 'washed',
 'by',
 'waves',
 'and',
 'cooled',
 'by',
 'breezes',
 'which',
 'a',
 'few',
 'hours',
 'previous',
 'were',
 'out',
 'of',
 'sight',
 'of',
 'land',
 'look',
 'at',
 'the',
 'crowds',
 'of',
 'water-gazers',
 'there']

## Delimited flat files

In [38]:
line = 'Ljubljana|1966/01/01|14.14|699'

In [39]:
print(line.split('|'))

['Ljubljana', '1966/01/01', '14.14', '699']

### The csv module

In [40]:
cat data/DATA_temp_data.txt

State|Month Day, Year Code|Avg Daily Max Air Temperature (F)|Record Count for Daily Max Air Temp (F)
Illinois|1979/01/01|17.48|994
Illinois|1979/01/02|4.64|994
Illinois|1979/01/03|11.05|994
Illinois|1979/01/04|9.51|994
Illinois|1979/05/15|68.42|994
Illinois|1979/05/16|70.29|994
Illinois|1979/05/17|75.34|994
Illinois|1979/05/18|79.13|994
Illinois|1979/05/19|74.94|994

In [42]:
import csv


with open('data/DATA_temp_data.txt', newline='') as f:
    results = [fileds for fileds in csv.reader(f, delimiter='|')]
    print(results)

[['State', 'Month Day, Year Code', 'Avg Daily Max Air Temperature (F)', 'Record Count for Daily Max Air Temp (F)'], ['Illinois', '1979/01/01', '17.48', '994'], ['Illinois', '1979/01/02', '4.64', '994'], ['Illinois', '1979/01/03', '11.05', '994'], ['Illinois', '1979/01/04', '9.51', '994'], ['Illinois', '1979/05/15', '68.42', '994'], ['Illinois', '1979/05/16', '70.29', '994'], ['Illinois', '1979/05/17', '75.34', '994'], ['Illinois', '1979/05/18', '79.13', '994'], ['Illinois', '1979/05/19', '74.94', '994']]

### Reading and Writing Data in Text Format with pandas

[Dokumentacija](http://pandas.pydata.org/pandas-docs/stable/user_guide/io.html)

<table border="1" class="colwidths-given docutils">
<colgroup>
<col width="12%">
<col width="40%">
<col width="24%">
<col width="24%">
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Format Type</th>
<th class="head">Data Description</th>
<th class="head">Reader</th>
<th class="head">Writer</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Comma-separated_values">CSV</a></td>
<td><a class="reference internal" href="#io-read-csv-table"><span class="std std-ref">read_csv</span></a></td>
<td><a class="reference internal" href="#io-store-in-csv"><span class="std std-ref">to_csv</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td><a class="reference external" href="https://www.json.org/">JSON</a></td>
<td><a class="reference internal" href="#io-json-reader"><span class="std std-ref">read_json</span></a></td>
<td><a class="reference internal" href="#io-json-writer"><span class="std std-ref">to_json</span></a></td>
</tr>
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/HTML">HTML</a></td>
<td><a class="reference internal" href="#io-read-html"><span class="std std-ref">read_html</span></a></td>
<td><a class="reference internal" href="#io-html"><span class="std std-ref">to_html</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td>Local clipboard</td>
<td><a class="reference internal" href="#io-clipboard"><span class="std std-ref">read_clipboard</span></a></td>
<td><a class="reference internal" href="#io-clipboard"><span class="std std-ref">to_clipboard</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Microsoft_Excel">MS Excel</a></td>
<td><a class="reference internal" href="#io-excel-reader"><span class="std std-ref">read_excel</span></a></td>
<td><a class="reference internal" href="#io-excel-writer"><span class="std std-ref">to_excel</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://support.hdfgroup.org/HDF5/whatishdf5.html">HDF5 Format</a></td>
<td><a class="reference internal" href="#io-hdf5"><span class="std std-ref">read_hdf</span></a></td>
<td><a class="reference internal" href="#io-hdf5"><span class="std std-ref">to_hdf</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://github.com/wesm/feather">Feather Format</a></td>
<td><a class="reference internal" href="#io-feather"><span class="std std-ref">read_feather</span></a></td>
<td><a class="reference internal" href="#io-feather"><span class="std std-ref">to_feather</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://parquet.apache.org/">Parquet Format</a></td>
<td><a class="reference internal" href="#io-parquet"><span class="std std-ref">read_parquet</span></a></td>
<td><a class="reference internal" href="#io-parquet"><span class="std std-ref">to_parquet</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://msgpack.org/index.html">Msgpack</a></td>
<td><a class="reference internal" href="#io-msgpack"><span class="std std-ref">read_msgpack</span></a></td>
<td><a class="reference internal" href="#io-msgpack"><span class="std std-ref">to_msgpack</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Stata">Stata</a></td>
<td><a class="reference internal" href="#io-stata-reader"><span class="std std-ref">read_stata</span></a></td>
<td><a class="reference internal" href="#io-stata-writer"><span class="std std-ref">to_stata</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SAS_(software)">SAS</a></td>
<td><a class="reference internal" href="#io-sas-reader"><span class="std std-ref">read_sas</span></a></td>
<td>&nbsp;</td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://docs.python.org/3/library/pickle.html">Python Pickle Format</a></td>
<td><a class="reference internal" href="#io-pickle"><span class="std std-ref">read_pickle</span></a></td>
<td><a class="reference internal" href="#io-pickle"><span class="std std-ref">to_pickle</span></a></td>
</tr>
<tr class="row-even"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SQL">SQL</a></td>
<td><a class="reference internal" href="#io-sql"><span class="std std-ref">read_sql</span></a></td>
<td><a class="reference internal" href="#io-sql"><span class="std std-ref">to_sql</span></a></td>
</tr>
<tr class="row-odd"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/BigQuery">Google Big Query</a></td>
<td><a class="reference internal" href="#io-bigquery"><span class="std std-ref">read_gbq</span></a></td>
<td><a class="reference internal" href="#io-bigquery"><span class="std std-ref">to_gbq</span></a></td>
</tr>
</tbody>
</table>

#### CSV data

In [43]:
# primer1
!cat data/DATA_ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [44]:
df = pd.read_csv('data/DATA_ex1.csv')

In [45]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [46]:
pd.read_table('data/DATA_ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [47]:
#primer 2
!cat data/DATA_ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [49]:
pd.read_csv('data/DATA_ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [51]:
pd.read_csv('data/DATA_ex2.csv', names=['a','b','c','d', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [52]:
pd.read_csv('data/DATA_ex2.csv', 
            names=['a','b','c','d', 'message'],
           index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [53]:
# primer3
!cat data/DATA_ex3.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [59]:
pd.read_csv('data/DATA_ex3.csv', 
            skiprows=[0,2,3],
           index_col = 'message'
           )

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

##### Primer

In [60]:
!head -n 3 data/DATA_BL-Flickr-Images-Book.csv

Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
000000206,,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",,,,,monographic,http://www.flickr.com/photos/britishlibrary/tags/sysnum000000206,British Library HMNTS 12641.b.30.
000000216,,London; Virtue & Yorston,1868,Virtue & Co.,"All for Greed. [A novel. The dedication signed: A. A. A., i.e. Marie Pauline Rose, Baroness Blaze de Bury.]","A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",,,,,monographic,http://www.flickr.com/photos/britishlibrary/tags/sysnum000000216,British Library HMNTS 12626.cc.2.

In [61]:
df = pd.read_csv('data/DATA_BL-Flickr-Images-Book.csv', nrows=5)

In [62]:
df

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
0,206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12625.dd.1.
3,472,NaN,London,1851,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.","Appleyard, Ernest Silvanus.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 10369.bbb.15.
4,480,"A new edition, revised, etc.",London,1857,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.","BROOME, John Henry.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 9007.d.28.

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 15 columns):
Identifier                5 non-null int64
Edition Statement         1 non-null object
Place of Publication      5 non-null object
Date of Publication       5 non-null object
Publisher                 5 non-null object
Title                     5 non-null object
Author                    5 non-null object
Contributors              5 non-null object
Corporate Author          0 non-null float64
Corporate Contributors    0 non-null float64
Former owner              0 non-null float64
Engraver                  0 non-null float64
Issuance type             5 non-null object
Flickr URL                5 non-null object
Shelfmarks                5 non-null object
dtypes: float64(4), int64(1), object(10)
memory usage: 680.0+ bytes

In [65]:
df.columns.tolist()

['Identifier',
 'Edition Statement',
 'Place of Publication',
 'Date of Publication',
 'Publisher',
 'Title',
 'Author',
 'Contributors',
 'Corporate Author',
 'Corporate Contributors',
 'Former owner',
 'Engraver',
 'Issuance type',
 'Flickr URL',
 'Shelfmarks']

In [67]:
df = pd.read_csv('data/DATA_BL-Flickr-Images-Book.csv',
                 nrows = 5,
                 usecols = ['Identifier', 'Place of Publication', 'Date of Publication'],
                 dtype = {'Identifier': int, 'Place of Publication': str, 'Date of Publication': str},
                 index_col = 0
)

In [68]:
df

                Place of Publication Date of Publication
Identifier
206                           London         1879 [1878]
216         London; Virtue & Yorston                1868
218                           London                1869
472                           London                1851
480                           London                1857

**Writing data**

In [69]:
data = pd.read_csv('data/DATA_ex3.csv', skiprows=[0,2,3])

In [70]:
data

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [71]:
data.to_csv('out1.csv')

In [72]:
data.to_csv('out1.txt', sep='|')

In [74]:
!cat out1.txt

|a|b|c|d|message
0|1|2|3|4|hello
1|5|6|7|8|world
2|9|10|11|12|foo

In [75]:
data.to_csv('out1.txt', index=False, header=False)

In [76]:
!cat out1.txt

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [77]:
data.to_csv('out1.txt', index=False, columns=['a','b','c'])

In [78]:
!cat out1.txt

a,b,c
1,2,3
5,6,7
9,10,11

#### JSON Data

In [17]:
obj = """
    {"name": "Wes",
    "places_lived": ["United States", "Spain", "Germany"],
    "pet": null,
    "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
    {"name": "Katie", "age": 38,
    "pets": ["Sixes", "Stache", "Cisco"]}]
    }
"""

In [3]:
!head -n 1 data/DATA_health_inspection_chi_sample.json

{"address":"5255 W MADISON ST ","aka_name":"RED SNAPPER FISH CHICKEN & PIZZA","city":"CHICAGO","dba_name":"RED SNAPPER FISH CHICKEN & PIZZA","facility_type":"Restaurant","inspection_date":"2016-09-26T00:00:00.000","inspection_id":1965287,"inspection_type":"Canvass","latitude":41.8802365439,"license_":1991820.0,"location":{"type":"Point","coordinates":[-87.7572203921,41.8802365439]},"longitude":-87.7572203921,"results":"Pass w\/ Conditions","risk":"Risk 1 (High)","state":"IL","violations":"35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN THE WALLS AT WALL BASE NEAR THE MIXER IN REAR OF PREMISES AND THE PREP AREA OF FOOD SPILLS AND CLEAN THE WALL VENT IN PREP AREA ,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN THE INTERIOR PANEL OF THE ICE MACHINE IN REAR OF PREMISES | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN FLOORS THROUGHOUT PREMISES,ALONG WALL BASE AND CORNERS OF GREASE AND DIRT BUILD-UP,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST PROVIDE A LIGHT SHIELD COVER FOR THE WALK-IN FREEZER IN REAR OF PREMISES | 22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: OBSERVED NO CHEMICAL TEST STRIPS TO TEST THE SANITIZER AT 3 COMPARTMENT SINK,WHEN SINK IS SET UP FOR WASH,RINSE AND SANITIZE,INSTRUCTED TO PROVIDE SERIOUS VIOLATION 7-38-030 | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE A THERMOMETER INSIDE THE PREP COOLER IN PREP AREA","zip":60644.0}

In [4]:
import json

In [5]:
dta = []

In [6]:
with open('data/DATA_health_inspection_chi_sample.json') as json_file:
    for line in json_file:
        line = json.loads(line)
        dta.append(line)

In [9]:
dta[0]

{'address': '5255 W MADISON ST ',
 'aka_name': 'RED SNAPPER FISH CHICKEN & PIZZA',
 'city': 'CHICAGO',
 'dba_name': 'RED SNAPPER FISH CHICKEN & PIZZA',
 'facility_type': 'Restaurant',
 'inspection_date': '2016-09-26T00:00:00.000',
 'inspection_id': 1965287,
 'inspection_type': 'Canvass',
 'latitude': 41.8802365439,
 'license_': 1991820.0,
 'location': {'type': 'Point', 'coordinates': [-87.7572203921, 41.8802365439]},
 'longitude': -87.7572203921,
 'results': 'Pass w/ Conditions',
 'risk': 'Risk 1 (High)',
 'state': 'IL',
 'violations': '35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN THE WALLS AT WALL BASE NEAR THE MIXER IN REAR OF PREMISES AND THE PREP AREA OF FOOD SPILLS AND CLEAN THE WALL VENT IN PREP AREA ,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN THE INTERIOR PANEL OF THE ICE MACHINE IN REAR OF PREMISES | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN FLOORS THROUGHOUT PREMISES,ALONG WALL BASE AND CORNERS OF GREASE AND DIRT BUILD-UP,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST PROVIDE A LIGHT SHIELD COVER FOR THE WALK-IN FREEZER IN REAR OF PREMISES | 22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: OBSERVED NO CHEMICAL TEST STRIPS TO TEST THE SANITIZER AT 3 COMPARTMENT SINK,WHEN SINK IS SET UP FOR WASH,RINSE AND SANITIZE,INSTRUCTED TO PROVIDE SERIOUS VIOLATION 7-38-030 | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE A THERMOMETER INSIDE THE PREP COOLER IN PREP AREA',
 'zip': 60644.0}

In [10]:
len(dta)

1000

In [11]:
dta[0]['location']

{'type': 'Point', 'coordinates': [-87.7572203921, 41.8802365439]}

##### Vaja

In [12]:
def remove_entry(record):
    try:
        del record['location']
    except KeyError:
        pass
    
    return record

In [13]:
def parse_json(record):
    return json.loads(record, object_hook=remove_entry)

In [14]:
with open('data/DATA_health_inspection_chi_sample.json') as json_file:
    dta = [parse_json(line) for line in json_file]

In [15]:
dta[0]

{'address': '5255 W MADISON ST ',
 'aka_name': 'RED SNAPPER FISH CHICKEN & PIZZA',
 'city': 'CHICAGO',
 'dba_name': 'RED SNAPPER FISH CHICKEN & PIZZA',
 'facility_type': 'Restaurant',
 'inspection_date': '2016-09-26T00:00:00.000',
 'inspection_id': 1965287,
 'inspection_type': 'Canvass',
 'latitude': 41.8802365439,
 'license_': 1991820.0,
 'longitude': -87.7572203921,
 'results': 'Pass w/ Conditions',
 'risk': 'Risk 1 (High)',
 'state': 'IL',
 'violations': '35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN THE WALLS AT WALL BASE NEAR THE MIXER IN REAR OF PREMISES AND THE PREP AREA OF FOOD SPILLS AND CLEAN THE WALL VENT IN PREP AREA ,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN THE INTERIOR PANEL OF THE ICE MACHINE IN REAR OF PREMISES | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN FLOORS THROUGHOUT PREMISES,ALONG WALL BASE AND CORNERS OF GREASE AND DIRT BUILD-UP,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST PROVIDE A LIGHT SHIELD COVER FOR THE WALK-IN FREEZER IN REAR OF PREMISES | 22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: OBSERVED NO CHEMICAL TEST STRIPS TO TEST THE SANITIZER AT 3 COMPARTMENT SINK,WHEN SINK IS SET UP FOR WASH,RINSE AND SANITIZE,INSTRUCTED TO PROVIDE SERIOUS VIOLATION 7-38-030 | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE A THERMOMETER INSIDE THE PREP COOLER IN PREP AREA',
 'zip': 60644.0}

##### Reading JSON with pandas

In [18]:
import pandas as pd
import numpy as np

In [16]:
!cat data/DATA_ex4.json

[{"a": 1, "b": 2, "c": 3},
{"a": 4, "b": 5, "c": 6},
{"a": 7, "b": 8, "c": 9}]

In [19]:
data = pd.read_json('data/DATA_ex4.json')

In [20]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

###### Vaja

In [24]:
data = pd.read_json('data/DATA_health_inspection_chi_sample.json',
                    orient = 'records',
                   lines = True)

In [29]:
data.loc[0, 'violations']

'35. WALLS, CEILINGS, ATTACHED EQUIPMENT CONSTRUCTED PER CODE: GOOD REPAIR, SURFACES CLEAN AND DUST-LESS CLEANING METHODS - Comments: MUST CLEAN THE WALLS AT WALL BASE NEAR THE MIXER IN REAR OF PREMISES AND THE PREP AREA OF FOOD SPILLS AND CLEAN THE WALL VENT IN PREP AREA ,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 33. FOOD AND NON-FOOD CONTACT EQUIPMENT UTENSILS CLEAN, FREE OF ABRASIVE DETERGENTS - Comments: MUST CLEAN THE INTERIOR PANEL OF THE ICE MACHINE IN REAR OF PREMISES | 34. FLOORS: CONSTRUCTED PER CODE, CLEANED, GOOD REPAIR, COVING INSTALLED, DUST-LESS CLEANING METHODS USED - Comments: MUST CLEAN FLOORS THROUGHOUT PREMISES,ALONG WALL BASE AND CORNERS OF GREASE AND DIRT BUILD-UP,INSTRUCTED TO CLEAN AND MAINTAIN AREA | 36. LIGHTING: REQUIRED MINIMUM FOOT-CANDLES OF LIGHT PROVIDED, FIXTURES SHIELDED - Comments: MUST PROVIDE A LIGHT SHIELD COVER FOR THE WALK-IN FREEZER IN REAR OF PREMISES | 22. DISH MACHINES: PROVIDED WITH ACCURATE THERMOMETERS, CHEMICAL TEST KITS AND SUITABLE GAUGE COCK - Comments: OBSERVED NO CHEMICAL TEST STRIPS TO TEST THE SANITIZER AT 3 COMPARTMENT SINK,WHEN SINK IS SET UP FOR WASH,RINSE AND SANITIZE,INSTRUCTED TO PROVIDE SERIOUS VIOLATION 7-38-030 | 40. REFRIGERATION AND METAL STEM THERMOMETERS PROVIDED AND CONSPICUOUS - Comments: MUST PROVIDE A THERMOMETER INSIDE THE PREP COOLER IN PREP AREA'

#### Reading Microsoft Excel Files

In [30]:
xlsx = pd.ExcelFile('data/DATA_SampleData.xlsx')

In [35]:
pd.read_excel(xlsx, 'Sheet1').head()

   OrderDate   Region      Rep    Item  Units  Unit Cost   Total
0 2018-01-06     East    Jones  Pencil     95       1.99  189.05
1 2018-01-23  Central   Kivell  Binder     50      19.99  999.50
2 2018-02-09  Central  Jardine  Pencil     36       4.99  179.64
3 2018-02-26  Central     Gill     Pen     27      19.99  539.73
4 2018-03-15     West  Sorvino  Pencil     56       2.99  167.44

In [36]:
#način 2

frame = pd.read_excel('data/DATA_SampleData.xlsx', 'Sheet1')

In [38]:
frame1 = frame.head()

In [39]:
frame1.to_excel('out.xlsx')

## Data Cleaning and Preparation

### Handling Missing Data

#### Trade-Offs in Missing Data Conventions

- masking approach
- sentinel approach

#### Missing Data in Pandas

#### None: Pythonic missing data

In [40]:
vals1 = np.array([1, None, 3, 4])

In [41]:
vals1

array([1, None, 3, 4], dtype=object)

In [42]:
for dtype in ['object', 'int']:
    print('dtype = ', dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype =  object
44.9 ms ± 194 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

dtype =  int
1.22 ms ± 10.4 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [43]:
vals1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

#### NaN: Missing numerical data

In [44]:
vals2 = np.array([1, np.nan, 3, 4])

In [45]:
vals2.dtype

dtype('float64')

In [46]:
1 + np.nan

nan

In [49]:
np.nan + np.nan

nan

In [47]:
0 * np.nan

nan

In [48]:
vals2.sum()

nan

In [50]:
vals2.max()

/home/leon/anaconda3/lib/python3.7/site-packages/numpy/core/_methods.py:28: RuntimeWarning: invalid value encountered in reduce
  return umr_maximum(a, axis, None, out, keepdims, initial)

nan

In [52]:
np.nansum(vals2)

8.0

In [54]:
np.nanmin(vals2)

1.0

#### NaN and None in Pandas

In [55]:
pd.Series([1, np.nan, 2, None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [56]:
x = pd.Series(range(2), dtype=int)

In [57]:
x

0    0
1    1
dtype: int64

In [59]:
x[0] = None

In [60]:
x

0    NaN
1    1.0
dtype: float64

In [62]:
y = pd.Series(['sfsf','fsfs','thh'])

In [64]:
y

0    sfsf
1    fsfs
2     thh
dtype: object

In [67]:
y[0] = np.nan

In [68]:
y

0     NaN
1    fsfs
2     thh
dtype: object

The following table lists the upcasting conventions in Pandas when NA values are introduced:

<table>
<thead><tr>
<th>Typeclass</th>
<th>Conversion When Storing NAs</th>
<th>NA Sentinel Value</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>floating</code></td>
<td>No change</td>
<td><code>np.nan</code></td>
</tr>
<tr>
<td><code>object</code></td>
<td>No change</td>
<td><code>None</code> or <code>np.nan</code></td>
</tr>
<tr>
<td><code>integer</code></td>
<td>Cast to <code>float64</code></td>
<td><code>np.nan</code></td>
</tr>
<tr>
<td><code>boolean</code></td>
<td>Cast to <code>object</code></td>
<td><code>None</code> or <code>np.nan</code></td>
</tr>
</tbody>
</table>

#### Operating on Null Values

- `isnull()`: Generate a boolean mask indicating missing values
- `notnull()`: Opposite of isnull()
- `dropna()`: Return a filtered version of the data
- `fillna()`: Return a copy of the data with missing values filled or imputed

##### Detecting null values

In [69]:
data = pd.Series([1, np.nan, 'hello', None])

In [70]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [71]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [73]:
data[data.notnull()]

0        1
2    hello
dtype: object

##### Dropping null values

In [74]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])

In [75]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [76]:
data.dropna()

0        1
2    hello
dtype: object

In [77]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [78]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [79]:
df.dropna(how='any')

     0    1  2
1  2.0  3.0  5

In [82]:
df[3]=np.nan

In [83]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [86]:
df.dropna(how='all', axis='columns')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [88]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [87]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

##### Filling null values

In [89]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))

In [90]:
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [91]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [95]:
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [96]:
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [97]:
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [98]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [101]:
df2 = df.fillna(method='ffill', axis=1)

In [102]:
df2.fillna(method='bfill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  4.0  4.0  6.0  6.0

In [104]:
df = pd.DataFrame([[np.nan,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])

In [105]:
df

     0    1  2
0  NaN  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [106]:
df.fillna(method='ffill', axis=1)

     0    1    2
0  NaN  NaN  2.0
1  2.0  3.0  5.0
2  NaN  4.0  6.0

In [107]:
df.fillna(method='bfill', axis=1)

     0    1    2
0  2.0  2.0  2.0
1  2.0  3.0  5.0
2  4.0  4.0  6.0

### Removing Duplicates

In [113]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 4, 2, 3, 3, 4, 4]})

In [114]:
data

    k1  k2
0  one   1
1  two   4
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [115]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6     True
dtype: bool

In [116]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   4
2  one   2
3  two   3
4  one   3

### Transforming Data Using a Function or Mapping

In [117]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [118]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [122]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [123]:
lowercase = data['food'].str.lower()

In [124]:
lowercase

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [125]:
data['animal'] = lowercase.map(meat_to_animal)

In [126]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values

In [127]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [128]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [129]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [131]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [132]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [133]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [137]:
data.replace([[-999], -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [141]:
data.replace(list(range(-2000,0)), np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

### Change datatype

In [142]:
df = pd.read_csv('data/DATA_BL-Flickr-Images-Book.csv')

In [143]:
df.head(3)

,Identifier,Edition Statement,Place of Publication,Date of Publication,Publisher,Title,Author,Contributors,Corporate Author,Corporate Contributors,Former owner,Engraver,Issuance type,Flickr URL,Shelfmarks
0,206,NaN,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,"FORBES, Walter.",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12641.b.30.
1,216,NaN,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12626.cc.2.
2,218,NaN,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.","BLAZE DE BURY, Marie Pauline Rose - Baroness",NaN,NaN,NaN,NaN,monographic,http://www.flickr.com/photos/britishlibrary/ta...,British Library HMNTS 12625.dd.1.

In [146]:
df.dtypes

Identifier                  int64
Edition Statement          object
Place of Publication       object
Date of Publication        object
Publisher                  object
Title                      object
Author                     object
Contributors               object
Corporate Author          float64
Corporate Contributors    float64
Former owner               object
Engraver                  float64
Issuance type              object
Flickr URL                 object
Shelfmarks                 object
dtype: object

In [145]:
df.dtypes.value_counts()

object     11
float64     3
int64       1
dtype: int64

In [148]:
df2 = df.select_dtypes(include=['float64', 'int64']).head(5)

In [149]:
df2

   Identifier  Corporate Author  Corporate Contributors  Engraver
0         206               NaN                     NaN       NaN
1         216               NaN                     NaN       NaN
2         218               NaN                     NaN       NaN
3         472               NaN                     NaN       NaN
4         480               NaN                     NaN       NaN

In [150]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
Identifier                5 non-null int64
Corporate Author          0 non-null float64
Corporate Contributors    0 non-null float64
Engraver                  0 non-null float64
dtypes: float64(3), int64(1)
memory usage: 240.0 bytes

**[pandas.DataFrame.astype](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.astype.html)**: Cast a pandas object to a specified dtype dtype.

In [153]:
df2['Identifier'] = df['Identifier'].astype('int16')

In [154]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
Identifier                5 non-null int16
Corporate Author          0 non-null float64
Corporate Contributors    0 non-null float64
Engraver                  0 non-null float64
dtypes: float64(3), int16(1)
memory usage: 210.0 bytes

### Dropping Columns in a DataFrame

In [163]:
df = pd.read_csv('data/DATA_BL-Flickr-Images-Book.csv')

In [156]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8287 entries, 0 to 8286
Data columns (total 15 columns):
Identifier                8287 non-null int64
Edition Statement         773 non-null object
Place of Publication      8287 non-null object
Date of Publication       8106 non-null object
Publisher                 4092 non-null object
Title                     8287 non-null object
Author                    6509 non-null object
Contributors              8287 non-null object
Corporate Author          0 non-null float64
Corporate Contributors    0 non-null float64
Former owner              1 non-null object
Engraver                  0 non-null float64
Issuance type             8287 non-null object
Flickr URL                8287 non-null object
Shelfmarks                8287 non-null object
dtypes: float64(3), int64(1), object(11)
memory usage: 971.2+ KB

In [157]:
to_drop = ['Edition Statement',
    'Corporate Author',
    'Corporate Contributors',
    'Former owner',
    'Engraver',
    'Contributors',
    'Issuance type',
    'Shelfmarks']

In [160]:
df.drop(to_drop, axis=1, inplace=True)

In [161]:
df.head(3)

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
0,206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...

In [164]:
df.drop(columns=to_drop, inplace=True)

In [165]:
df.head(3)

,Identifier,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
0,206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
1,216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
2,218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...

### Changing the Index of a DataFrame

In [166]:
df['Identifier'].is_unique

True

In [167]:
df = df.set_index('Identifier')
#df.set_index('Identifier', inplace=True)

In [168]:
df.head(3)

,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
Identifier,,,,,,
206,London,1879 [1878],S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
216,London; Virtue & Yorston,1868,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
218,London,1869,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...

In [169]:
df.loc[206]

Place of Publication                                               London
Date of Publication                                           1879 [1878]
Publisher                                                S. Tinsley & Co.
Title                                   Walter Forbes. [A novel.] By A. A
Author                                                              A. A.
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Name: 206, dtype: object

### Tidying up Fields in the Data

In [170]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8287 entries, 206 to 4160339
Data columns (total 6 columns):
Place of Publication    8287 non-null object
Date of Publication     8106 non-null object
Publisher               4092 non-null object
Title                   8287 non-null object
Author                  6509 non-null object
Flickr URL              8287 non-null object
dtypes: object(6)
memory usage: 773.2+ KB

In [171]:
df.get_dtype_counts()

object    6
dtype: int64

In [173]:
df['Date of Publication'].head(10)

Identifier
206     1879 [1878]
216            1868
218            1869
472            1851
480            1857
481            1875
519            1872
667             NaN
874            1676
1143           1679
Name: Date of Publication, dtype: object

In [175]:
df.loc[1905:, 'Date of Publication'].head(10)

Identifier
1905           1888
1929    1839, 38-54
2836           1897
2854           1865
2956        1860-63
2957           1873
3017           1866
3131           1899
4598           1814
4884           1820
Name: Date of Publication, dtype: object


 **Regular Expression**

[Regular Expression HOWTO](https://docs.python.org/3.7/howto/regex.html)

[Testiranje RE](https://regex101.com/r/3AJ1Pv/1)

In [177]:
regex = r'^(\d{4})'

In [183]:
extr = df['Date of Publication'].str.extract(regex, expand=False)

In [191]:
extr

Identifier
206        1879
216        1868
218        1869
472        1851
480        1857
481        1875
519        1872
667         NaN
874        1676
1143       1679
1280       1802
1808       1859
1905       1888
1929       1839
2836       1897
2854       1865
2956       1860
2957       1873
3017       1866
3131       1899
4598       1814
4884       1820
4976       1800
5382       1847
5385        NaN
5389        NaN
5432       1893
6036       1805
6821       1837
7521       1896
           ...
4053464     NaN
4063671    1896
4072044     NaN
4077038     NaN
4079258    1750
4079262    1879
4112297     NaN
4112525    1889
4112839     NaN
4113012    1876
4113816     NaN
4114334     NaN
4114390    1708
4114889     NaN
4114986    1777
4115138     NaN
4116063    1866
4117526    1862
4117583    1894
4117749    1868
4117751    1882
4117752    1883
4156359    1898
4157746    1811
4157862    1867
4158088    1838
4158128    1831
4159563     NaN
4159587    1834
4160339    1834
Name: Date of Publication, Length: 8287, dtype: object

In [184]:
extr.head()

Identifier
206    1879
216    1868
218    1869
472    1851
480    1857
Name: Date of Publication, dtype: object

In [187]:
df['Date of Publication'] = pd.to_numeric(extr)

In [189]:
df['Date of Publication'].dtype

dtype('float64')

In [188]:
df.head()

,Place of Publication,Date of Publication,Publisher,Title,Author,Flickr URL
Identifier,,,,,,
206,London,1879.0,S. Tinsley & Co.,Walter Forbes. [A novel.] By A. A,A. A.,http://www.flickr.com/photos/britishlibrary/ta...
216,London; Virtue & Yorston,1868.0,Virtue & Co.,All for Greed. [A novel. The dedication signed...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
218,London,1869.0,"Bradbury, Evans & Co.",Love the Avenger. By the author of “All for Gr...,"A., A. A.",http://www.flickr.com/photos/britishlibrary/ta...
472,London,1851.0,James Darling,"Welsh Sketches, chiefly ecclesiastical, to the...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...
480,London,1857.0,Wertheim & Macintosh,"[The World in which I live, and my place in it...","A., E. S.",http://www.flickr.com/photos/britishlibrary/ta...

In [190]:
df['Date of Publication'].isnull().sum() / len(df)

0.11717147339205986

### Cleaning the Entire Dataset Using the applymap Function

In [193]:
!head -n 20 data/DATA_university_towns.txt

Alabama[edit]
Auburn (Auburn University)[1]
Florence (University of North Alabama)
Jacksonville (Jacksonville State University)[2]
Livingston (University of West Alabama)[2]
Montevallo (University of Montevallo)[2]
Troy (Troy University)[2]
Tuscaloosa (University of Alabama, Stillman College, Shelton State)[3][4]
Tuskegee (Tuskegee University)[5]
Alaska[edit]
Fairbanks (University of Alaska Fairbanks)[2]
Arizona[edit]
Flagstaff (Northern Arizona University)[6]
Tempe (Arizona State University)
Tucson (University of Arizona)
Arkansas[edit]
Arkadelphia (Henderson State University, Ouachita Baptist University)[2]
Conway (Central Baptist College, Hendrix College, University of Central Arkansas)[2]
Fayetteville (University of Arkansas)[7]
Jonesboro (Arkansas State University)[8]

In [194]:
university_towns = []

In [195]:
with open('data/DATA_university_towns.txt') as file:
    for line in file:
        if '[edit]' in line:
            state = line
        else:
            university_towns.append((state, line))

In [197]:
university_towns[:18]

[('Alabama[edit]\n', 'Auburn (Auburn University)[1]\n'),
 ('Alabama[edit]\n', 'Florence (University of North Alabama)\n'),
 ('Alabama[edit]\n', 'Jacksonville (Jacksonville State University)[2]\n'),
 ('Alabama[edit]\n', 'Livingston (University of West Alabama)[2]\n'),
 ('Alabama[edit]\n', 'Montevallo (University of Montevallo)[2]\n'),
 ('Alabama[edit]\n', 'Troy (Troy University)[2]\n'),
 ('Alabama[edit]\n',
  'Tuscaloosa (University of Alabama, Stillman College, Shelton State)[3][4]\n'),
 ('Alabama[edit]\n', 'Tuskegee (Tuskegee University)[5]\n'),
 ('Alaska[edit]\n', 'Fairbanks (University of Alaska Fairbanks)[2]\n'),
 ('Arizona[edit]\n', 'Flagstaff (Northern Arizona University)[6]\n'),
 ('Arizona[edit]\n', 'Tempe (Arizona State University)\n'),
 ('Arizona[edit]\n', 'Tucson (University of Arizona)\n'),
 ('Arkansas[edit]\n',
  'Arkadelphia (Henderson State University, Ouachita Baptist University)[2]\n'),
 ('Arkansas[edit]\n',
  'Conway (Central Baptist College, Hendrix College, University of Central Arkansas)[2]\n'),
 ('Arkansas[edit]\n', 'Fayetteville (University of Arkansas)[7]\n'),
 ('Arkansas[edit]\n', 'Jonesboro (Arkansas State University)[8]\n'),
 ('Arkansas[edit]\n', 'Magnolia (Southern Arkansas University)[2]\n'),
 ('Arkansas[edit]\n',
  'Monticello (University of Arkansas at Monticello)[2]\n')]

In [198]:
towns_df = pd.DataFrame(university_towns, columns=['State', 'RegionName'])

In [199]:
towns_df.head(15)

               State                                         RegionName
0    Alabama[edit]\n                    Auburn (Auburn University)[1]\n
1    Alabama[edit]\n           Florence (University of North Alabama)\n
2    Alabama[edit]\n  Jacksonville (Jacksonville State University)[2]\n
3    Alabama[edit]\n       Livingston (University of West Alabama)[2]\n
4    Alabama[edit]\n         Montevallo (University of Montevallo)[2]\n
5    Alabama[edit]\n                        Troy (Troy University)[2]\n
6    Alabama[edit]\n  Tuscaloosa (University of Alabama, Stillman Co...
7    Alabama[edit]\n                Tuskegee (Tuskegee University)[5]\n
8     Alaska[edit]\n    Fairbanks (University of Alaska Fairbanks)[2]\n
9    Arizona[edit]\n       Flagstaff (Northern Arizona University)[6]\n
10   Arizona[edit]\n                 Tempe (Arizona State University)\n
11   Arizona[edit]\n                   Tucson (University of Arizona)\n
12  Arkansas[edit]\n  Arkadelphia (Henderson State University, Ouach...
13  Arkansas[edit]\n  Conway (Central Baptist College, Hendrix Colle...
14  Arkansas[edit]\n         Fayetteville (University of Arkansas)[7]\n

In [203]:
def clean_df(item):
    if ' (' in item:
        return item[:item.find(' (')]
    elif '[' in item:
        return item[:item.find('[')]
    else:
        return item

In [201]:
towns_df = towns_df.applymap(clean_df)

In [202]:
towns_df.head(15)

       State    RegionName
0    Alabama        Auburn
1    Alabama      Florence
2    Alabama  Jacksonville
3    Alabama    Livingston
4    Alabama    Montevallo
5    Alabama          Troy
6    Alabama    Tuscaloosa
7    Alabama      Tuskegee
8     Alaska     Fairbanks
9    Arizona     Flagstaff
10   Arizona         Tempe
11   Arizona        Tucson
12  Arkansas   Arkadelphia
13  Arkansas        Conway
14  Arkansas  Fayetteville

### Renaming Axis Indexes

In [204]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [205]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [206]:
transform = lambda x: x[:4].upper()

In [207]:
'Colorado'[:4].upper()

'COLO'

In [208]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [209]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [210]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [211]:
data.index = data.index.map(transform)

In [212]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [215]:
data.rename(index={'OHIO': 'INDiANA'},
           columns={'three': '333a'},
           inplace=True)

In [216]:
data

         one  two  333a  four
INDiANA    0    1     2     3
COLO       4    5     6     7
NEW        8    9    10    11

### Example: Renaming Columns and Skipping Rows

In [217]:
!head -n 5 data/DATA_olympics.csv

0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15
,? Summer,01 !,02 !,03 !,Total,? Winter,01 !,02 !,03 !,Total,? Games,01 !,02 !,03 !,Combined total
Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70

In [220]:
olympics_df = pd.read_csv('data/DATA_olympics.csv', header=1)

In [222]:
olympics_df.head()

,Unnamed: 0,? Summer,01 !,02 !,03 !,Total,? Winter,01 !.1,02 !.1,03 !.1,Total.1,? Games,01 !.2,02 !.2,03 !.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12

In [223]:
new_names =  {'Unnamed: 0': 'Country',
    '? Summer': 'Summer Olympics',
    '01 !': 'Gold',
    '02 !': 'Silver',
    '03 !': 'Bronze',
    '? Winter': 'Winter Olympics',
    '01 !.1': 'Gold.1',
    '02 !.1': 'Silver.1',
    '03 !.1': 'Bronze.1',
    '? Games': '# Games',
    '01 !.2': 'Gold.2',
    '02 !.2': 'Silver.2',
    '03 !.2': 'Bronze.2'}

In [224]:
olympics_df.rename(columns=new_names, inplace=True)

In [225]:
olympics_df.head()

,Country,Summer Olympics,Gold,Silver,Bronze,Total,Winter Olympics,Gold.1,Silver.1,Bronze.1,Total.1,# Games,Gold.2,Silver.2,Bronze.2,Combined total
0,Afghanistan (AFG),13,0,0,2,2,0,0,0,0,0,13,0,0,2,2
1,Algeria (ALG),12,5,2,8,15,3,0,0,0,0,15,5,2,8,15
2,Argentina (ARG),23,18,24,28,70,18,0,0,0,0,41,18,24,28,70
3,Armenia (ARM),5,1,2,9,12,6,0,0,0,0,11,1,2,9,12
4,Australasia (ANZ) [ANZ],2,3,4,5,12,0,0,0,0,0,2,3,4,5,12